# Kaggle比赛之泰坦尼克号幸存者预测
## 1 数据预处理
首先导入必要的库。

In [4]:
import pandas as pd

读取原始训练集和测试集。

In [5]:
train_data = pd.read_csv('data/train.csv')
train_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [6]:
test_data = pd.read_csv('data/test.csv')
test_data

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

（1）记录训练集和测试集的数量。

（2）分割训练集的特征和标签。

（3）合并训练集的特征和测试集构成新的DataFrame。

In [7]:
num_train = train_data.shape[0]
num_test = test_data.shape[0]
num_train, num_test

(891, 418)

In [8]:
columns = train_data.columns.values
new_columns = columns[columns != 'Survived']
train_features = train_data.loc[:, new_columns]
train_features

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [9]:
train_labels = train_data.loc[:, ['Survived']]
train_labels

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [10]:
all_features = pd.concat([train_features, test_data])
all_features

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

（1）先分析数据并删除无用数据。

（2）连续值（即数值）的缺失值使用平均值填充。

这里可以先标准化然后用0值来填充，也是一样的效果。

（3）离散值转换成one-hot表示。

get_dummy函数，绝绝子。

In [11]:
# 对取值进行计数
column = 'Cabin'
all_features.loc[:, column].value_counts(), all_features.loc[:, column].value_counts().value_counts()

(Cabin
 C23 C25 C27        6
 G6                 5
 B57 B59 B63 B66    5
 C22 C26            4
 F33                4
                   ..
 A14                1
 E63                1
 E12                1
 E38                1
 C105               1
 Name: count, Length: 186, dtype: int64,
 count
 1    107
 2     63
 4      7
 3      6
 5      2
 6      1
 Name: count, dtype: int64)

In [12]:
# 判断某一列是否是另一列的子分类
def a_can_infer_b(df: pd.DataFrame, a: str, b: str) -> bool:
    assert a in df.columns, f'{a}不是df的列！'
    assert b in df.columns, f'{b}不是df的列！'
    d = {}
    for i, a_unit, b_unit in zip(range(len(df)), df.loc[:, a], df.loc[:, b]):
        if a_unit not in d:
            d[a_unit] = b_unit
        elif d[a_unit] == b_unit:
            pass
        else:
            return False
    return True

a_can_infer_b(all_features, 'Fare', 'Ticket')

False

In [47]:
# 删除无用的列
drop_columns = ['PassengerId', 'Name']
columns = all_features.columns.values
for c in drop_columns:
    columns = columns[columns != c]
all_features = all_features.loc[:, columns]
all_features

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,female,35.0,1,0,113803,53.1000,C123,S
4,3,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...
413,3,male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1,female,39.0,0,0,PC 17758,108.9000,C105,C
415,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,3,male,NaN,0,0,359309,8.0500,NaN,S
417,3,male,NaN,1,1,2668,22.3583,NaN,C

In [48]:
all_features.dtypes

Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [49]:
# 若无法获得测试数据，则可根据训练数据计算均值和标准差
numeric_features = all_features.dtypes[all_features.dtypes != 'object'].index
all_features[numeric_features] = all_features[numeric_features].apply(lambda x: (x - x.mean()) / (x.std()))
# 在标准化数据之后，所有均值消失，因此我们可以将缺失值设置为0
all_features[numeric_features] = all_features[numeric_features].fillna(0)
all_features

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0.841595,male,-0.546789,0.481104,-0.444829,A/5 21171,-0.503210,NaN,S
1,-1.545507,female,0.563282,0.481104,-0.444829,PC 17599,0.733941,C85,C
2,0.841595,female,-0.269271,-0.478904,-0.444829,STON/O2. 3101282,-0.490169,NaN,S
3,-1.545507,female,0.355144,0.481104,-0.444829,113803,0.382632,C123,S
4,0.841595,male,0.355144,-0.478904,-0.444829,373450,-0.487754,NaN,S
...,...,...,...,...,...,...,...,...,...
413,0.841595,male,0.000000,-0.478904,-0.444829,A.5. 3236,-0.487754,NaN,S
414,-1.545507,female,0.632662,-0.478904,-0.444829,PC 17758,1.460712,C105,C
415,0.841595,male,0.597972,-0.478904,-0.444829,SOTON/O.Q. 3101262,-0.503210,NaN,S
416,0.841595,male,0.000000,-0.478904,-0.444829,359309,-0.487754,NaN,S
417,0.841595,male,0.000000,0.481104,0.710492,2668,-0.211311,NaN,C

In [51]:
all_features = pd.get_dummies(all_features, dummy_na=True)
all_features

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Sex_nan,Ticket_110152,Ticket_110413,...,Cabin_F33,Cabin_F38,Cabin_F4,Cabin_G6,Cabin_T,Cabin_nan,Embarked_C,Embarked_Q,Embarked_S,Embarked_nan
0,0.841595,-0.546789,0.481104,-0.444829,-0.503210,False,True,False,False,False,...,False,False,False,False,False,True,False,False,True,False
1,-1.545507,0.563282,0.481104,-0.444829,0.733941,True,False,False,False,False,...,False,False,False,False,False,False,True,False,False,False
2,0.841595,-0.269271,-0.478904,-0.444829,-0.490169,True,False,False,False,False,...,False,False,False,False,False,True,False,False,True,False
3,-1.545507,0.355144,0.481104,-0.444829,0.382632,True,False,False,False,False,...,False,False,False,False,False,False,False,False,True,False
4,0.841595,0.355144,-0.478904,-0.444829,-0.487754,False,True,False,False,False,...,False,False,False,False,False,True,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
413,0.841595,0.000000,-0.478904,-0.444829,-0.487754,False,True,False,False,False,...,False,False,False,False,False,True,False,False,True,False
414,-1.545507,0.632662,-0.478904,-0.444829,1.460712,True,False,False,False,False,...,False,False,False,False,False,False,True,False,False,False
415,0.841595,0.597972,-0.478904,-0.444829,-0.503210,False,True,False,False,False,...,False,False,False,False,False,True,False,False,True,False
416,0.841595,0.000000,-0.478904,-0.444829,-0.487754,False,True,False,False,False,...,False,False,False,False,False,True,False,False,True,False
417,0.841595,0.000000,0.481104,0.710492,-0.211311,False,True,False,False,False,...,False,False,False,False,False,True,True,False,False,False

## 2 模型和训练函数的定义

In [22]:
from model import ModelForSimpleClassification

model = ModelForSimpleClassification()

## 3 验证选择训练参数

## 4 训练模型

## 5 在测试集上预测